                                               pandas_basic_NCERT

In [1]:
# creating series 
import pandas as pd
series1 =pd.Series([10,20,30])
display(series1)

0    10
1    20
2    30
dtype: int64

In [2]:
series2 = pd.Series(["ravi","saif","john"],index = [3,2,1])

In [3]:
series2

3    ravi
2    saif
1    john
dtype: object

In [4]:
# creating series from numpy arrays
import numpy as np
array1 =np.arange(6)
array1

array([0, 1, 2, 3, 4, 5])

In [5]:
series3  =pd.Series(array1,index = [1,2,3,4,5,6])
series3

1    0
2    1
3    2
4    3
5    4
6    5
dtype: int32

In [6]:
# creation of series from dictionary 
dict1 = {'country':'capital','India': 'NewDelhi', 'UK': 'London', 'Japan': 'Tokyo'}
series4 = pd.Series(dict1)
display(series4)

country     capital
India      NewDelhi
UK           London
Japan         Tokyo
dtype: object

In [7]:
# accessing Elements of series
seriesNum = pd.Series([10,20,30])
seriesNum[1]

20

In [8]:
seriesMnths = pd.Series([2,3,4],index=["Feb","Mar","Apr"])
seriesMnths["Feb"]

2

In [9]:
seriesCapCntry = pd.Series(['NewDelhi', 'WashingtonDC', 'London', 'Paris'], index=['India', 'USA', 'UK', 'France'])

In [10]:
seriesCapCntry

India         NewDelhi
USA       WashingtonDC
UK              London
France           Paris
dtype: object

                                    Attributes of Series

In [11]:
seriesCapCntry.name = 'Capitals'  # assigning  name to the series

In [12]:
seriesCapCntry

India         NewDelhi
USA       WashingtonDC
UK              London
France           Paris
Name: Capitals, dtype: object

In [13]:
seriesCapCntry.index.name = "countires"

In [14]:
seriesCapCntry

countires
India         NewDelhi
USA       WashingtonDC
UK              London
France           Paris
Name: Capitals, dtype: object

In [15]:
# seriesCapCntry.values.name = "capital"

                                          method of series

In [16]:
# method of series
seriesTenTwenty =pd.Series(np.arange(10,30,2))

In [17]:
seriesTenTwenty

0    10
1    12
2    14
3    16
4    18
5    20
6    22
7    24
8    26
9    28
dtype: int32

In [18]:
seriesTenTwenty.head()

0    10
1    12
2    14
3    16
4    18
dtype: int32

In [19]:
seriesTenTwenty.tail()

5    20
6    22
7    24
8    26
9    28
dtype: int32

In [20]:
seriesTenTwenty.count()

10

In [21]:
seriesA = pd.Series([1,2,3,4,5], index = ['a', 'b', 'c', 'd', 'e'])

In [22]:
seriesA

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [23]:
seriesB = pd.Series([10,20,-10,-50,100], index = ['z', 'y', 'a', 'c', 'e'])

In [24]:
seriesB

z     10
y     20
a    -10
c    -50
e    100
dtype: int64

normal addition

In [25]:
seriesA + seriesB

a     -9.0
b      NaN
c    -47.0
d      NaN
e    105.0
y      NaN
z      NaN
dtype: float64

In [26]:
# using fill_value =0 means wherever in series A  the element will be null that  that will get replace with "0"
seriesA.add(seriesB,fill_value=0)

a     -9.0
b      2.0
c    -47.0
d      4.0
e    105.0
y     20.0
z     10.0
dtype: float64

In [27]:
seriesA.sub(seriesB, fill_value=1000)

a     11.0
b   -998.0
c     53.0
d   -996.0
e    -95.0
y    980.0
z    990.0
dtype: float64

                                                  DataFrame

In [28]:
import numpy as np 
array1  =np.array([10,20,30])
array2 =np.array([100,200,300])
array3=np.array([-10,-20,-30,-40])
df4 = pd.DataFrame([array1,array2,array3],columns = ["A","B","C","D"])

In [29]:
df4

     A    B    C     D
0   10   20   30   NaN
1  100  200  300   NaN
2  -10  -20  -30 -40.0

In [30]:
# Create list of dictionaries
listDict = [{'a':10, 'b':20}, {'a':5, 'b':10, 'c':20}]
df5 =pd.DataFrame(listDict)
display(df5)

    a   b     c
0  10  20   NaN
1   5  10  20.0

In [31]:
# Creation of DataFrame from Dictionary of Lists
dictForest = {'State': ['Assam', 'Delhi', 'Kerala'],'GArea': [78438, 1483, 38852] ,'VDF' : [2797, 6.72,1663]}

In [32]:
df6=pd.DataFrame(dictForest)
display(df6)

    State  GArea      VDF
0   Assam  78438  2797.00
1   Delhi   1483     6.72
2  Kerala  38852  1663.00

In [33]:
# Creation of DataFrame from Series
seriesA = pd.Series([1,2,3,4,5],index = ['a', 'b', 'c', 'd', 'e'])
seriesB = pd.Series ([1000,2000,-1000,-5000,1000],index = ['a', 'b', 'c', 'd', 'e'])
seriesB = pd.Series([10,20,-10,-50,100],index = ['z', 'y', 'a', 'c', 'e'])

In [34]:
df7 = pd.DataFrame([seriesA,seriesB,seriesB])
display(df7)

      a    b     c    d      e     z     y
0   1.0  2.0   3.0  4.0    5.0   NaN   NaN
1 -10.0  NaN -50.0  NaN  100.0  10.0  20.0
2 -10.0  NaN -50.0  NaN  100.0  10.0  20.0

In [35]:
df8 = pd.DataFrame([seriesA, seriesB])
df8

      a    b     c    d      e     z     y
0   1.0  2.0   3.0  4.0    5.0   NaN   NaN
1 -10.0  NaN -50.0  NaN  100.0  10.0  20.0

In [36]:
ResultSheet={'Arnab': pd.Series([90, 91, 97],index=['Maths','Science','Hindi']),'Ramit': pd.Series([92, 81, 96],index=['Maths','Science','Hindi']),'Samridhi': pd.Series([89, 91, 88],index=['Maths','Science','Hindi']),'Riya': pd.Series([81, 71, 67],index=['Maths','Science','Hindi']),'Mallika': pd.Series([94, 95, 99],index=['Maths','Science','Hindi'])}

In [37]:
ResultSheet={'Arnab': pd.Series([90, 91, 97],index=['Maths','Science','Hindi']),'Ramit': pd.Series([92, 81, 96],index=['Maths','Science','Hindi']),'Samridhi': pd.Series([89, 91, 88],index=['Maths','Science','Hindi']),'Riya': pd.Series([81, 71, 67],index=['Maths','Science','Hindi']),'Mallika': pd.Series([94, 95, 99],index=['Maths','Science','Hindi'])}

In [38]:
ResultSheetDF = pd.DataFrame(ResultSheet)

In [39]:
display(ResultSheetDF)

         Arnab  Ramit  Samridhi  Riya  Mallika
Maths       90     92        89    81       94
Science     91     81        91    71       95
Hindi       97     96        88    67       99

In [40]:
ResultSheetDF["preeti"] = [89,90,96]

In [41]:
display(ResultSheetDF)

         Arnab  Ramit  Samridhi  Riya  Mallika  preeti
Maths       90     92        89    81       94      89
Science     91     81        91    71       95      90
Hindi       97     96        88    67       99      96

In [42]:
# addition of new row
ResultSheetDF.loc["English"] = np.random.randint(85, 89, size=6, dtype=int)

In [43]:
display(ResultSheetDF)

         Arnab  Ramit  Samridhi  Riya  Mallika  preeti
Maths       90     92        89    81       94      89
Science     91     81        91    71       95      90
Hindi       97     96        88    67       99      96
English     86     86        85    85       85      86

In [44]:
# changing rows values 
# lets consider maths value  = 99
ResultSheetDF.loc["Maths"] =99

In [45]:
ResultSheetDF

         Arnab  Ramit  Samridhi  Riya  Mallika  preeti
Maths       99     99        99    99       99      99
Science     91     81        91    71       95      90
Hindi       97     96        88    67       99      96
English     86     86        85    85       85      86

In [46]:
# Deleting Rows or Columns from a DataFrame

In [47]:
ResultSheetDF = ResultSheetDF.drop("Science",axis =0)  # here axis =0 i.e its operating rows by rows

In [48]:
ResultSheetDF

         Arnab  Ramit  Samridhi  Riya  Mallika  preeti
Maths       99     99        99    99       99      99
Hindi       97     96        88    67       99      96
English     86     86        85    85       85      86

In [49]:
ResultSheetDF.drop(["Arnab","Ramit"],axis =1) # here axis = 1 means columns by columns

         Samridhi  Riya  Mallika  preeti
Maths          99    99       99      99
Hindi          88    67       99      96
English        85    85       85      86

In [50]:
ResultSheetDF

         Arnab  Ramit  Samridhi  Riya  Mallika  preeti
Maths       99     99        99    99       99      99
Hindi       97     96        88    67       99      96
English     86     86        85    85       85      86

In [51]:
# Renaming Row Labels of a DataFrame
ResultSheetDF.rename({"Maths":"sub1","Hindi":"sub2","English":"sub3"},axis = "index")

      Arnab  Ramit  Samridhi  Riya  Mallika  preeti
sub1     99     99        99    99       99      99
sub2     97     96        88    67       99      96
sub3     86     86        85    85       85      86

In [52]:
ResultSheetDF

         Arnab  Ramit  Samridhi  Riya  Mallika  preeti
Maths       99     99        99    99       99      99
Hindi       97     96        88    67       99      96
English     86     86        85    85       85      86

                                Accessing DataFrames Element through  Indexing

In [53]:
ResultSheetDF.loc['English']

Arnab       86
Ramit       86
Samridhi    85
Riya        85
Mallika     85
preeti      86
Name: English, dtype: int64

In [54]:
ResultSheet={'Arnab': pd.Series([90, 91, 97],index=['Maths','Science','Hindi']),'Ramit': pd.Series([92, 81, 96],index=['Maths','Science','Hindi']),'Samridhi': pd.Series([89, 91, 88],index=['Maths','Science','Hindi']),'Riya': pd.Series([81, 71, 67],index=['Maths','Science','Hindi']),'Mallika': pd.Series([94, 95, 99],index=['Maths','Science','Hindi'])}

In [55]:
ResultDF = pd.DataFrame(ResultSheet)

In [56]:
ResultDF

         Arnab  Ramit  Samridhi  Riya  Mallika
Maths       90     92        89    81       94
Science     91     81        91    71       95
Hindi       97     96        88    67       99

In [57]:
ResultDF.iloc[0:2,0:4]
# When a single column label is passed, it returns the column 
# as a Series.
#  ResultDF.loc[:,'Arnab']

         Arnab  Ramit  Samridhi  Riya
Maths       90     92        89    81
Science     91     81        91    71

In [58]:
ResultDF.loc['Maths': 'Science', "Arnab":"Samridhi"]

         Arnab  Ramit  Samridhi
Maths       90     92        89
Science     91     81        91

In [59]:
ResultDF.loc['Science']

Arnab       91
Ramit       81
Samridhi    91
Riya        71
Mallika     95
Name: Science, dtype: int64

In [60]:
ResultDF.loc['Maths'] > 90

Arnab       False
Ramit        True
Samridhi    False
Riya        False
Mallika      True
Name: Maths, dtype: bool

In [61]:
ResultDF.loc[:,'Arnab']>90

Maths      False
Science     True
Hindi       True
Name: Arnab, dtype: bool

                                        joining dataframe

In [62]:
dFrame1=pd.DataFrame([[1, 2, 3], [4, 5], [6]], columns=['C1', 'C2', 'C3'], index=['R1', 'R2', 'R3'])

In [63]:
dFrame1

    C1   C2   C3
R1   1  2.0  3.0
R2   4  5.0  NaN
R3   6  NaN  NaN

In [64]:
dFrame2=pd.DataFrame([[10, 20], [30], [40, 50]], columns=['C2', 'C5'], index=['R4', 'R2', 'R5'])

In [65]:
dFrame1=dFrame1.append(dFrame2)

C:\Users\mrpam\AppData\Local\Temp\ipykernel_21380\2125746391.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  dFrame1=dFrame1.append(dFrame2)

In [66]:
dFrame1

     C1    C2   C3    C5
R1  1.0   2.0  3.0   NaN
R2  4.0   5.0  NaN   NaN
R3  6.0   NaN  NaN   NaN
R4  NaN  10.0  NaN  20.0
R2  NaN  30.0  NaN   NaN
R5  NaN  40.0  NaN  50.0

                                        -----casestudy_NCERT--------

In [67]:
name = ["madhu","kusum","kinshuk","ankit","shruti"]
y_2014 = np.random.randint(100,40000,size = 5)
y_2015 = np.random.randint(12000,45000,size = 5)
y_2016 = np.random.randint(20000,125000,size = 5)
y_2017 = np.random.randint(5000,90000,size = 5)

In [68]:
df_sales = pd.DataFrame({"name":name,"y_2014":y_2014,"y_2015":y_2015,"y_2016":y_2016,"y_2017":y_2017})

In [69]:
df_sales.set_index("name")

         y_2014  y_2015  y_2016  y_2017
name
madhu     33249   29157   24352   59454
kusum     32875   31281  112285   74991
kinshuk   37177   18659   70319   88368
ankit      8868   23998   58660   54483
shruti    37619   31166   88448   13444

In [70]:
df_sales.loc[0]

name      madhu
y_2014    33249
y_2015    29157
y_2016    24352
y_2017    59454
Name: 0, dtype: object

In [72]:
df_sales.loc[0:2]

      name  y_2014  y_2015  y_2016  y_2017
0    madhu   33249   29157   24352   59454
1    kusum   32875   31281  112285   74991
2  kinshuk   37177   18659   70319   88368

In [73]:
df_sales.loc[0:4:2]

      name  y_2014  y_2015  y_2016  y_2017
0    madhu   33249   29157   24352   59454
2  kinshuk   37177   18659   70319   88368
4   shruti   37619   31166   88448   13444